src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Договоры/Forms/ФормаЭлемента/Module.bsl
// Форма элемента справочника "Договоры".
// Управляет отображением даты окончания (скрывается для бессрочных договоров)
// и автоматически формирует наименование договора по шаблону "№ <Номер> от <Дата>г."

#Область ОбработчикиСобытийФормы

// Обработчик открытия формы.
// При открытии настраиваем видимость реквизитов и формируем наименование договора.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимость();
    СформироватьНаименованиеДоговора(); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик изменения флажка "Бессрочный".
// При переключении бессрочности обновляем видимость даты окончания.
&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

// Обработчик изменения даты начала договора.
// При редактировании даты начала пересобираем наименование.
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
    СформироватьНаименованиеДоговора();
КонецПроцедуры

// Обработчик изменения номера договора.
// При редактировании номера пересобираем наименование.
&НаКлиенте
Процедура НомерПриИзменении(Элемент)
    СформироватьНаименованиеДоговора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает видимость реквизита "ДатаОкончания" в зависимости от признака "Бессрочный".
// Если договор бессрочный:
//   - поле даты окончания скрывается,
//   - ранее установленная дата окончания очищается (присваивается пустая дата '0001.01.01'),
//     чтобы избежать хранения некорректных данных.
// Если договор срочный:
//   - поле даты окончания отображается.
&НаКлиенте
Процедура УстановитьВидимость()
    Если Объект.Бессрочный Тогда 
        Элементы.ДатаОкончания.Видимость = Ложь;
        Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
            Объект.ДатаОкончания = '0001,01,01';
        КонецЕсли;
    Иначе
        Элементы.ДатаОкончания.Видимость = Истина;
    КонецЕсли;
КонецПроцедуры

// Формирует представление договора (наименование) по данным номера и даты начала.
// Шаблоны:
//   - если заполнены и номер, и дата начала: "№ <Номер> от <Дата>г"
//   - если заполнен только номер (дата не задана): "№ <Номер>г"
//   - во всех остальных случаях (нет номера, но есть дата или оба не заполнены):
//     " от <Дата>г" (может давать неинформативное название, если номер отсутствует)
&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
    Если ЗначениеЗаполнено(Объект.Номер)
        И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
        // Полный вариант: номер и дата.
        Объект.Наименование = "№ " + Объект.Номер + " от " + Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy") + "г";
    ИначеЕсли ЗначениеЗаполнено(Объект.Номер)
        И Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
        // Только номер (дата не указана).
        Объект.Наименование = "№ " + Объект.Номер + "г";
    Иначе 
        // Нет номера (дата может быть любой, включая пустую).
        Объект.Наименование = " от " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + "г";
    КонецЕсли;
КонецПроцедуры

#КонецОбласти
